---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.#ctor
source: html/1dab4021-5704-04db-60b9-ffd0480407a1.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.#ctor Method

Initializes a new instance of the GeomCombinationSet class

## Syntax (C#)
```csharp
public GeomCombinationSet()
```